---
kind: property
id: P:Autodesk.Revit.DB.CompoundStructure.HasStructuralDeck
source: html/0a185ddd-e618-7b5b-ba1d-6d659ae79d7d.htm
---
# Autodesk.Revit.DB.CompoundStructure.HasStructuralDeck Property

Checks if the compound structure has a structural deck.

## Syntax (C#)
```csharp
public bool HasStructuralDeck { get; }
```